import telebot
import random 
from telebot import types
token = "5043466517:AAFhjwVmYhNxIwmzgkbhkDH86XBeMs66zlA"
bot = telebot.TeleBot(token)
p3 = types.InlineKeyboardMarkup()
p5 = types.InlineKeyboardButton(text = "[!] 𝗚𝗛𝗢𝗦𝗧 ^ 𝗦𝗢𝗨𝗥𝗖𝗘 🇰🇼",url="t.me/pjpppppp")
p4 = types.InlineKeyboardButton(text ='↫التالي↬', callback_data= 'c2')
p1 = types.InlineKeyboardButton(text = "أضفني إلى مجموعتك",url="https://t.me/tuupacbot?startgroup=true")
abod = [ 

"اخر افلام شاهدتها", 

"ما هيا عيوب  ؟ ", 

" هل بتكراش ع حد في حياتك؟", 

" ينفع نرتبط؟", 

" ممكن توريني صوره بتحبها؟", 

" ممكن نبقي صحااب ع الفيس؟", 

"عندك كام اكس في حياتك؟ ", 

"ينفع تبعتلي رقمك؟ ", 

" ما تيجي اعزمني ع حاجه بحبها؟", 

"ينفع احضنك؟ ", 

"قولي ع اكبر غلطه ندمان عليهاا؟ ", 

"عندك كام سنه؟ ", 

" عامل بلوك لكام واحد عندك؟", 

" قولي سر محدش يعرفه؟", 

" عندك كام اكس في حياتك؟", 

"بتعرف تقلش وتهزر؟ ", 

" لونك المفضل هو؟", 

"كتابك المفضل", 

"هوايتك المفضله", 

"علاقتك مع اهلك", 

" ما السيء في هذه الحياة ؟ ", 

"أجمل شيء حصل معك خلال هذا الاسبوع ؟ ", 

"سؤال ينرفزك ؟ ", 

" هل يعجبك  ؟؟ ", 

" اكثر ممثل تحبه ؟ ", 

"قد تخيلت شي في بالك وصار ؟ ", 

"شيء عندك اهم من الناس ؟ ", 

"تفضّل النقاش الطويل او تحب الاختصار ؟ ", 

"وش أخر شي ضيعته؟ ", 

"اي رايك في  ؟ ", 

"كم مره حبيت؟ ", 

" اكثر المتابعين عندك باي برنامج؟", 

" اخر مره ضربت عشره كانت متى ؟", 

" نسبه الندم عندك للي وثقت فيهم ؟", 

"تحب ترتبط بكيرفي ولا فلات؟", 

" جربت شعور احد يحبك بس انت مو قادر تحبه؟", 

" تجامل الناس ولا اللي بقلبك على لسانك؟", 

" عمرك ضحيت باشياء لاجل شخص م يسوى ؟", 

"مغني تلاحظ أن صوته يعجب الجميع إلا أنت؟ ", 

" اخر غلطات عمرك؟ ", 

" مسلسل كرتوني له ذكريات جميلة عندك؟ ", 

" ما أكثر تطبيق تقضي وقتك عليه؟ ", 

" أول شيء يخطر في بالك إذا سمعت كلمة نجوم ؟ ", 

" قدوتك من الأجيال السابقة؟ ", 

" أكثر طبع تهتم بأن يتواجد في شريك/ة حياتك؟ ", 

"أكثر حيوان تخاف منه؟ ", 

" ما هي طريقتك في الحصول على الراحة النفسية؟ ", 

" إيموجي يعبّر عن مزاجك الحالي؟ ", 

" أكثر تغيير ترغب أن تغيّره في نفسك؟ ", 

"أكثر شيء أسعدك اليوم؟ ", 

"اي رايك في الدنيا دي ؟ ", 

"ما هو أفضل حافز للشخص؟ ", 

"ما الذي يشغل بالك في الفترة الحالية؟", 

"اخر شيء ندمت عليه؟ ", 

"شاركنا صورة احترافية من تصويرك؟ ", 

"تتابع انمي؟ إذا نعم ما أفضل انمي شاهدته ", 

"يرد عليك متأخر على رسالة مهمة وبكل برود، موقفك؟ ", 

"نصيحه تبدا ب -لا- ؟ ", 

"كتاب أو رواية تقرأها هذه الأيام؟ ", 

"فيلم عالق في ذهنك لا تنساه مِن روعته؟ ", 

"يوم لا يمكنك نسيانه؟ ", 

"شعورك الحالي في جملة؟ ", 

"كلمة لشخص بعيد؟ ", 

"صفة يطلقها عليك الشخص المفضّل؟ ", 

"أغنية عالقة في ذهنك هاليومين؟ ", 

"أكلة مستحيل أن تأكلها؟ ", 

"كيف قضيت نهارك؟ ", 

"تصرُّف ماتتحمله؟ ", 

"موقف غير حياتك؟ ", 

"اكثر مشروب تحبه؟ ", 

"القصيدة اللي تأثر فيك؟ ", 

"متى يصبح الصديق غريب ", 

"وين نلقى السعاده برايك؟ ", 

"تاريخ ميلادك؟ ", 

"قهوه و لا شاي؟ ", 

"من محبّين الليل أو الصبح؟ ", 

"حيوانك المفضل؟ ", 

"كلمة غريبة ومعناها؟ ", 

"كم تحتاج من وقت لتثق بشخص؟ ", 

"اشياء نفسك تجربها؟ ", 

"يومك ضاع على؟ ", 

"كل شيء يهون الا ؟ ", 

"اسم ماتحبه ؟ ", 

"وقفة إحترام للي إخترع ؟ ", 

"أقدم شيء محتفظ فيه من صغرك؟ ", 

"كلمات ماتستغني عنها بسوالفك؟ ", 

"وش الحب بنظرك؟ ", 

"حب التملك في شخصِيـتك ولا ؟ ", 

"تخطط للمستقبل ولا ؟ ", 

"موقف محرج ماتنساه ؟ ", 

"من طلاسم لهجتكم ؟ ", 

"اعترف باي حاجه ؟ ", 

"عبّر عن مودك بصوره ؟ ",

"اخر مره ضربت عشره كانت متى ؟", 

"اسم دايم ع بالك ؟ ", 

"اشياء تفتخر انك م سويتها ؟ ", 

" لو بكيفي كان ؟ ", 

  "أكثر جملة أثرت بك في حياتك؟ ",

  "إيموجي يوصف مزاجك حاليًا؟ ",

  "أجمل اسم بنت بحرف الباء؟ ",

  "كيف هي أحوال قلبك؟ ",

  "أجمل مدينة؟ ",

  "كيف كان أسبوعك؟ ",

  "شيء تشوفه اكثر من اهلك ؟ ",

  "اخر مره فضفضت؟ ",

  "قد كرهت احد بسبب اسلوبه؟ ",

  "قد حبيت شخص وخذلك؟ ",

  "كم مره حبيت؟ ",

  "اكبر غلطة بعمرك؟ ",

  "نسبة النعاس عندك حاليًا؟ ",

  "شرايكم بمشاهير التيك توك؟ ",

  "ما الحاسة التي تريد إضافتها للحواس الخمسة؟ ",

  "اسم قريب لقلبك؟ ",

  "مشتاق لمطعم كنت تزوره قبل الحظر؟ ",

  "ما أول مشروع تتوقع أن تقوم بإنشائه إذا أصبحت مليونير؟ ",

  "أغنية عالقة في ذهنك هاليومين؟ ",

  "متى اخر مره قريت قران؟ ", 
 "لو عشقك مطوري تقبل؟ "
]
#@PJPPPPPP - @bbannd @UuUwUw 
@bot.message_handler(commands=['start'])
def sendto_channel(message):
 f2 = message.from_user.first_name
 t2 = message.from_user.username
 p3.add(p1)
 p3.add(p5)
 bot.reply_to(message,text="""*اهلا بك عزيزي *- [{}](t.me/{})*، 
انا بوت كت تويت قم بضافتي لكروبك، وأرسل كت، *""".format(f2,t2),disable_web_page_preview=True,parse_mode="markdown",reply_markup=p3)
@bot.message_handler(func=lambda m : True )
def ktgame(message):
    # @bbannd @UuUwUw @PJPPPPPP 
    if message.text == 'كت' or message.text == 'كت تويت' or message.text == "تت":
     r = random.choice(abod)
     p3.add(p4)
     p3.add(p5)
     bot.reply_to(message,f"""*{r}
- - - - - - - - - - - - - 
@Tuupacbot*""",parse_mode="markdown",reply_markup=p3)
@bot.callback_query_handler(func= lambda call : True)
def callback_data(call):
  
  if call.data == "c2":
   r = random.choice(abod)
   p3 = types.InlineKeyboardMarkup()
   p3.add(p4)
   p3.add(p5)
   bot.edit_message_text(chat_id=call.message.chat.id,message_id=call.message.message_id,text=f"""*{r}
- - - - - - - - - - - - - -
@Tuupacbot*""",reply_markup=p3,parse_mode="markdown")
print("""يكلك الواحد اذا مات حسناته تروح وياه واذا عاش محد يعترف بيه المهم روح جرب الكود مابي شي شغال..... 
- - - - - - - - - - - - - - - - - - """)
bot.polling()